Autodesk.Revit.DB.IFC.IFCFileModelOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCFileModelOptions.UserControlledInverses
Indicates if the inverses are controlled by Revit or users. True by users, false by Revit.
Since:
2013

Autodesk.Revit.DB.IFC.IFCFileModelOptions.CacheSize
The cache size of the file.
Since:
2013

Autodesk.Revit.DB.IFC.IFCFileModelOptions.SchemaName
The name of the schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCFileModelOptions.SchemaFile
The full name of an IFC schema file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCFileModelOptions.#ctor
Creates a default IFCFileModelOptions. The default schema file is empty and cache size is 8192.
Since:
2013

Autodesk.Revit.DB.IFC.IFCFileModelOptions
This class contains options to create an IFC file model.
Since:
2013